// ===========================================================
// 📁 ARQUIVO: data/fatos-fundamentos-pedidos.js
// ===========================================================
// Estrutura-base do Banco Jurídico Fato–Fundamento–Pedido (FFP)
// Criado para o Editor de Petições Trabalhistas com IA integrada
// Linguagem: Português jurídico | Estilo: Forense completo
// ===========================================================

export const FFP = [

  // ======================================
  // 🧾 VÍNCULO DE EMPREGO E REGISTRO
  // ======================================

  {
    "fato": "CTPS não anotada",
    "fundamentos": [
      "Art. 2º e 3º da CLT — definem os elementos da relação de emprego",
      "Art. 29 da CLT — obrigação do empregador de anotar a CTPS",
      "Art. 7º, I e XIII, CF/88 — direitos sociais básicos do trabalhador",
      "Súmula 212/TST — ônus da prova da dispensa é do empregador",
      "Súmula 363/TST — efeitos do vínculo reconhecido judicialmente"
    ],
    "pedidos": [
      "Reconhecimento do vínculo empregatício desde o início da prestação de serviços",
      "Anotação da CTPS com as datas corretas de admissão e demissão",
      "Pagamento de todas as verbas rescisórias decorrentes do vínculo",
      "Recolhimento do FGTS e multa de 40%",
      "Aplicação das multas dos arts. 467 e 477 da CLT"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a prestação de serviços sem anotação em CTPS, com base nos documentos anexados (CTPS, holerites, mensagens e comunicações). Detalhe as atividades exercidas, jornada, salário e subordinação, seguindo o padrão da Justiça do Trabalho. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Vínculo e registro"
  },

  {
    "fato": "Pejotização fraudulenta",
    "fundamentos": [
      "Art. 3º da CLT — caracterização do vínculo de emprego mesmo sob contrato civil ou pessoa jurídica",
      "Art. 9º da CLT — nulidade de atos que visem desvirtuar a relação de emprego",
      "Súmula 331/TST — terceirização ilícita e responsabilidade do tomador",
      "Súmula 363/TST — efeitos do vínculo reconhecido judicialmente"
    ],
    "pedidos": [
      "Reconhecimento de vínculo empregatício direto com o tomador de serviços",
      "Anotação retroativa na CTPS",
      "Pagamento de verbas salariais e rescisórias",
      "Recolhimento do FGTS e INSS",
      "Reflexos legais sobre todas as parcelas contratuais"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a relação de trabalho disfarçada de prestação de serviços via pessoa jurídica, destacando elementos de pessoalidade, habitualidade, subordinação e onerosidade. Utilize linguagem técnica e descreva a fraude na contratação. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Vínculo e registro"
  },

  {
    "fato": "Terceirização ilícita",
    "fundamentos": [
      "Súmula 331/TST — proíbe terceirização da atividade-fim da empresa tomadora",
      "Art. 9º da CLT — nulidade dos atos fraudulentos",
      "Art. 2º e 3º da CLT — definição da relação de emprego"
    ],
    "pedidos": [
      "Reconhecimento de vínculo direto com a tomadora de serviços",
      "Anotação da CTPS e inclusão em folha de pagamento",
      "Pagamento de diferenças salariais e benefícios equivalentes aos empregados diretos",
      "Recolhimentos fundiários e previdenciários"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a terceirização irregular da atividade-fim, apontando o vínculo direto com a tomadora. Destaque subordinação, controle hierárquico e integração às atividades permanentes da empresa. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Vínculo e registro"
  },

  {
    "fato": "Contrato de estágio fraudulento",
    "fundamentos": [
      "Lei 11.788/2008 — exige vínculo educacional e supervisão pedagógica para validade do estágio",
      "Art. 3º da CLT — vínculo configurado na ausência dos requisitos legais",
      "Súmula 363/TST — efeitos do vínculo reconhecido judicialmente"
    ],
    "pedidos": [
      "Reconhecimento de vínculo empregatício desde o início da prestação",
      "Anotação na CTPS",
      "Pagamento de todas as verbas contratuais e rescisórias",
      "Recolhimento de FGTS e INSS"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo o estágio irregular, informando ausência de acompanhamento pedagógico, controle de jornada e inserção plena nas atividades da empresa. Fundamente que a relação se enquadra nos requisitos de vínculo empregatício. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Vínculo e registro"
  },

  {
    "fato": "Contrato de experiência prorrogado além do limite legal",
    "fundamentos": [
      "Art. 445, parágrafo único, da CLT — duração máxima de 90 dias",
      "Art. 451 da CLT — conversão em contrato por prazo indeterminado quando excedido o limite",
      "Súmula 188/TST — limites da prorrogação de contrato a termo"
    ],
    "pedidos": [
      "Reconhecimento de contrato por prazo indeterminado",
      "Anotação da condição de vínculo efetivo",
      "Pagamentos das verbas rescisórias correspondentes à dispensa imotivada"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a prorrogação indevida do contrato de experiência além do limite de 90 dias, demonstrando a continuidade do vínculo e a descaracterização do prazo determinado. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Vínculo e registro"
  },

  {
    "fato": "Empregado sem registro de jornada ou controle de ponto",
    "fundamentos": [
      "Art. 74, §2º, da CLT — obrigatoriedade de controle de jornada para empresas com mais de 20 empregados",
      "Súmula 338/TST — presunção de veracidade da jornada alegada pelo empregado na ausência de controles",
      "Art. 818 da CLT — ônus da prova"
    ],
    "pedidos": [
      "Reconhecimento da jornada alegada na inicial",
      "Pagamento das horas extras e reflexos",
      "Aplicação da presunção de veracidade da jornada"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a ausência de controle de jornada pelo empregador, mencionando a rotina de trabalho e a frequência de horas extras realizadas. Aponte a presunção favorável ao empregado conforme Súmula 338/TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Vínculo e registro"
  },

  // ---------------------------------------------------------
  // 🔸 BLOCO-RESUMO: VÍNCULO E REGISTRO
  // ---------------------------------------------------------
  {
    "modeloGeral": "Redija o capítulo completo 'DO VÍNCULO DE EMPREGO' abordando todas as hipóteses possíveis (CTPS não anotada, pejotização, terceirização ilícita, estágio fraudulento, prorrogação irregular de contrato e ausência de registro de jornada). Desenvolva o texto com base nas provas anexadas, descrevendo de forma clara as circunstâncias de prestação de serviços, a subordinação e a habitualidade, com base na CLT, Constituição Federal e Súmulas do TST.",
    "artigosRelacionados": [
      "Art. 2º, 3º, 29, 445, 451 e 74 da CLT",
      "Art. 7º, I e XIII da CF/88",
      "Súmulas 212, 331, 338 e 363 do TST"
    ],
    "categoria": "Vínculo e registro"
  },
  // ======================================
  // ⚖️ RESCISÃO CONTRATUAL E VERBAS
  // ======================================

  {
    "fato": "Dispensa sem justa causa",
    "fundamentos": [
      "Art. 7º, I, CF/88 — proteção contra dispensa arbitrária",
      "Arts. 477 e 487 da CLT — quitação e aviso prévio",
      "Lei 8.036/90 — FGTS e multa de 40%",
      "Súmula 305/TST — aviso prévio proporcional"
    ],
    "pedidos": [
      "Aviso prévio indenizado e proporcional",
      "Saldo de salário",
      "Férias vencidas e proporcionais + 1/3",
      "13º salário proporcional",
      "Depósito e liberação do FGTS com multa de 40%",
      "Entrega das guias TRCT e seguro-desemprego"
    ],
    "promptSugestao": "Redija o trecho fático narrando a dispensa sem justa causa do reclamante, descrevendo a data, ausência de aviso prévio trabalhado, falta de pagamento correto das verbas rescisórias e prejuízos decorrentes. Utilize linguagem forense e formal, baseando-se em comprovantes de salário e comunicações internas. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Rescisão e verbas"
  },

  {
    "fato": "Dispensa discriminatória",
    "fundamentos": [
      "Lei 9.029/95 — proíbe práticas discriminatórias no trabalho",
      "Art. 1º, III e IV, CF/88 — dignidade e valor social do trabalho",
      "Súmula 443/TST — presunção de dispensa discriminatória",
      "Art. 4º da Convenção 111 da OIT — combate à discriminação laboral"
    ],
    "pedidos": [
      "Reintegração imediata ao emprego",
      "Indenização substitutiva em caso de impossibilidade de retorno",
      "Pagamento de salários e direitos do período de afastamento",
      "Indenização por danos morais"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a dispensa discriminatória sofrida pelo reclamante, especificando o motivo e os indícios de discriminação (doença, idade, gravidez ou represália). Destaque o abalo moral e a violação dos princípios constitucionais. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Rescisão e verbas"
  },

  {
    "fato": "Rescisão indireta",
    "fundamentos": [
      "Art. 483 da CLT — hipóteses de falta grave do empregador",
      "Súmula 32/TST — rescisão indireta e efeitos",
      "Art. 9º da CLT — nulidade de atos fraudulentos",
      "Princípio da boa-fé contratual e dignidade do trabalhador"
    ],
    "pedidos": [
      "Reconhecimento da rescisão indireta do contrato",
      "Pagamento de todas as verbas rescisórias equivalentes à dispensa sem justa causa",
      "Liberação do FGTS e seguro-desemprego",
      "Multas dos arts. 467 e 477 da CLT"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo as faltas graves cometidas pelo empregador (como atrasos salariais, ausência de depósitos de FGTS ou assédio moral), que motivaram o pedido de rescisão indireta. Detalhe as consequências ao trabalhador e o término do contrato. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Rescisão e verbas"
  },

  {
    "fato": "Justa causa indevida",
    "fundamentos": [
      "Art. 482 da CLT — hipóteses taxativas de justa causa",
      "Princípios da proporcionalidade, imediatidade e gradação das penalidades",
      "Súmula 212/TST — ônus da prova do empregador"
    ],
    "pedidos": [
      "Reversão da dispensa por justa causa para dispensa sem justa causa",
      "Pagamento integral de todas as verbas rescisórias",
      "Liberação das guias de FGTS e seguro-desemprego",
      "Indenização por dano moral, se comprovada exposição vexatória"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a dispensa por justa causa aplicada de forma indevida, indicando a ausência de provas, o abuso disciplinar e a violação da proporcionalidade. Fundamente a injustiça da penalidade e seus reflexos sobre o trabalhador. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Rescisão e verbas"
  },

  {
    "fato": "Atraso no pagamento das verbas rescisórias",
    "fundamentos": [
      "Art. 477, §6º e §8º, da CLT — prazo para pagamento e multa",
      "Súmula 350/TST — mora no pagamento de verbas rescisórias",
      "Art. 459, §1º da CLT — pontualidade no pagamento de salário"
    ],
    "pedidos": [
      "Aplicação da multa do art. 477, §8º, da CLT",
      "Juros e correção monetária sobre as verbas rescisórias",
      "Reembolso de despesas decorrentes da mora (se comprovadas)"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo o atraso no pagamento das verbas rescisórias, informando as datas da dispensa e do efetivo pagamento, e os prejuízos materiais enfrentados pelo reclamante. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Rescisão e verbas"
  },

  {
    "fato": "Não entrega de documentos rescisórios",
    "fundamentos": [
      "Art. 477, §6º, CLT — obrigação de entrega das guias e termo de rescisão",
      "Súmula 330/TST — validade do termo de quitação apenas para parcelas discriminadas",
      "Art. 5º, XXXV, CF/88 — direito de acesso à Justiça"
    ],
    "pedidos": [
      "Obrigação de fazer consistente na entrega das guias TRCT e seguro-desemprego",
      "Multa do art. 477, §8º, da CLT",
      "Indenização por danos materiais se comprovado prejuízo"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a ausência de entrega dos documentos rescisórios (TRCT, guias de FGTS e seguro-desemprego), apontando os prejuízos sofridos e a resistência do empregador. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Rescisão e verbas"
  },

  {
    "fato": "Pedido de demissão viciado por coação",
    "fundamentos": [
      "Art. 151 do Código Civil — vício de consentimento por coação",
      "Art. 9º da CLT — nulidade dos atos que visem fraudar direitos trabalhistas",
      "Princípio da boa-fé objetiva e da proteção do trabalhador"
    ],
    "pedidos": [
      "Reconhecimento da nulidade do pedido de demissão",
      "Conversão em dispensa sem justa causa",
      "Pagamento das verbas rescisórias e liberação de guias"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo as circunstâncias em que o reclamante foi compelido a assinar pedido de demissão sob coação ou pressão, destacando a ausência de espontaneidade e a violação da boa-fé. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Rescisão e verbas"
  },

  // ---------------------------------------------------------
  // 🔸 BLOCO-RESUMO: RESCISÃO E VERBAS
  // ---------------------------------------------------------
  {
    "modeloGeral": "Redija o capítulo 'DA RESCISÃO CONTRATUAL E DAS VERBAS DEVIDAS', abordando todas as hipóteses possíveis: dispensa sem justa causa, dispensa discriminatória, rescisão indireta, justa causa indevida, atraso ou irregularidade no pagamento e entrega de documentos. Fundamente com base na CLT, Constituição Federal e Súmulas do TST, descrevendo os fatos de forma cronológica e técnica, e relacionando cada irregularidade às verbas correspondentes.",
    "artigosRelacionados": [
      "Arts. 477, 482, 483 e 487 da CLT",
      "Lei 8.036/90 — FGTS",
      "Lei 9.029/95 — dispensa discriminatória",
      "Súmulas 32, 212, 330, 350 e 443 do TST"
    ],
    "categoria": "Rescisão e verbas"
  },
  // ======================================
  // ⏰ JORNADA DE TRABALHO
  // ======================================

  {
    "fato": "Excesso de jornada e horas extras não pagas",
    "fundamentos": [
      "Art. 7º, XIII e XVI, CF/88 — limitação da jornada e adicional de horas extras",
      "Art. 58 e 59 da CLT — duração e prorrogação da jornada",
      "Súmula 85/TST — compensação de jornada",
      "Súmula 338/TST — presunção de veracidade da jornada alegada quando ausente controle"
    ],
    "pedidos": [
      "Pagamento das horas extras excedentes à 8ª diária e 44ª semanal",
      "Reflexos em férias, 13º, FGTS, repouso semanal e aviso prévio",
      "Adicional de 50% ou 100% conforme o caso",
      "Exibição de controles de ponto sob pena de confissão"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a jornada habitual do reclamante, informando o horário de entrada, saída, pausas e dias trabalhados, conforme os documentos anexados (cartões de ponto, escalas e comunicações). Mencione a ausência de pagamento correto das horas extras e seus reflexos. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Jornada de trabalho"
  },

  {
    "fato": "Intervalo intrajornada suprimido",
    "fundamentos": [
      "Art. 71 da CLT — direito a intervalo mínimo de 1 hora para refeição",
      "Súmula 437/TST — pagamento integral do período suprimido com acréscimo de 50%",
      "Art. 818 da CLT — ônus da prova"
    ],
    "pedidos": [
      "Pagamento de 1 hora extra diária com adicional de 50%",
      "Reflexos em férias, 13º, FGTS e demais parcelas",
      "Reconhecimento da invalidade de eventual acordo irregular"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a supressão do intervalo intrajornada, indicando o tempo efetivamente usufruído, as ordens da chefia e a ausência de condições adequadas para refeição e descanso. Fundamente conforme art. 71 da CLT e Súmula 437 do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Jornada de trabalho"
  },

  {
    "fato": "Trabalho em domingos e feriados sem folga compensatória",
    "fundamentos": [
      "Art. 9º da Lei 605/49 — direito ao repouso semanal remunerado",
      "Súmula 146/TST — pagamento em dobro do trabalho em domingos e feriados não compensados",
      "Art. 7º, XV, CF/88 — repouso semanal preferencialmente aos domingos"
    ],
    "pedidos": [
      "Pagamento em dobro pelos domingos e feriados laborados sem folga compensatória",
      "Reflexos em DSR, férias, 13º e FGTS",
      "Reconhecimento do descumprimento da Lei 605/49"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a frequência de trabalho em domingos e feriados, indicando a ausência de folgas compensatórias e os registros de jornada anexados. Destaque a habitualidade e a ausência de pagamento em dobro. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Jornada de trabalho"
  },

  {
    "fato": "Sobreaviso ou prontidão não remunerada",
    "fundamentos": [
      "Art. 244, §2º e §3º, CLT — regimes de sobreaviso e prontidão",
      "Súmula 428/TST — uso de celular e caracterização de sobreaviso",
      "Art. 4º da CLT — tempo à disposição do empregador"
    ],
    "pedidos": [
      "Pagamento das horas de sobreaviso à razão de 1/3 da hora normal",
      "Reflexos em férias, 13º, FGTS e DSR",
      "Reconhecimento de disponibilidade habitual fora do horário"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a permanência do reclamante em regime de sobreaviso ou prontidão, explicando o uso de celular, escalas de plantão e limitações à vida pessoal. Fundamente com base no art. 244 da CLT e Súmula 428 do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Jornada de trabalho"
  },

  {
    "fato": "Troca de uniformes e deslocamento interno sem registro de tempo",
    "fundamentos": [
      "Art. 4º da CLT — considera-se tempo de serviço o período em que o empregado esteja à disposição do empregador",
      "Súmula 366/TST — troca de uniforme e deslocamento interno devem integrar a jornada quando habituais",
      "Art. 58, §1º da CLT — tolerância de até 10 minutos diários"
    ],
    "pedidos": [
      "Reconhecimento do tempo de troca de uniforme e deslocamento como parte da jornada",
      "Pagamento das horas excedentes com adicional de 50%",
      "Reflexos legais"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo o tempo gasto diariamente para troca de uniformes, deslocamento interno e registro de ponto, apontando a habitualidade e ausência de pagamento. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Jornada de trabalho"
  },

  {
    "fato": "Turnos ininterruptos de revezamento",
    "fundamentos": [
      "Art. 7º, XIV, CF/88 — jornada especial de 6 horas para turnos ininterruptos",
      "Súmula 360/TST — descaracterização do turno apenas com interrupção real da atividade",
      "Art. 58 da CLT — limitação da jornada"
    ],
    "pedidos": [
      "Reconhecimento da jornada especial de 6 horas",
      "Pagamento de horas excedentes com adicional de 50%",
      "Reflexos legais sobre demais verbas"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a jornada realizada em turnos de revezamento, destacando a alternância de horários e os prejuízos à saúde e ao convívio social. Fundamente conforme art. 7º, XIV, CF/88 e Súmula 360/TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Jornada de trabalho"
  },

  // ---------------------------------------------------------
  // 🔸 BLOCO-RESUMO: JORNADA DE TRABALHO
  // ---------------------------------------------------------
  {
    "modeloGeral": "Redija o capítulo completo 'DA JORNADA DE TRABALHO', incluindo as hipóteses de excesso de jornada, horas extras não pagas, intervalos suprimidos, labor em domingos e feriados, sobreaviso e tempo à disposição. Estruture em parágrafos claros e técnicos, com base nas provas anexadas e nos registros de jornada. Fundamente conforme CLT, CF/88 e jurisprudência do TST, sempre com linguagem forense precisa e objetiva.",
    "artigosRelacionados": [
      "Arts. 4º, 58, 59, 71 e 244 da CLT",
      "Art. 7º, XIII, XIV, XV e XVI da CF/88",
      "Súmulas 85, 146, 360, 366, 428 e 437 do TST"
    ],
    "categoria": "Jornada de trabalho"
  },
  // ======================================
  // ⚙️ ADICIONAIS E CONDIÇÕES DE TRABALHO
  // ======================================

  {
    "fato": "Trabalho em condições insalubres",
    "fundamentos": [
      "Art. 189 e 192 da CLT — definição e adicional de insalubridade",
      "NR-15 do MTE — agentes insalubres e limites de tolerância",
      "Súmula 80/TST — supressão do adicional apenas com eliminação do agente nocivo"
    ],
    "pedidos": [
      "Pagamento do adicional de insalubridade em grau correspondente",
      "Reflexos em férias, 13º, FGTS e demais verbas",
      "Indenização substitutiva caso não seja possível o retorno ao ambiente"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo as condições insalubres enfrentadas pelo reclamante, detalhando os agentes nocivos (calor, ruído, produtos químicos etc.) e os documentos anexados (laudos, PPP, ASO). Fundamente nos arts. 189 e 192 da CLT e NR-15 do MTE. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Adicionais e condições"
  },

  {
    "fato": "Trabalho em condições periculosas",
    "fundamentos": [
      "Art. 193 da CLT — atividades e operações perigosas",
      "NR-16 do MTE — contato com inflamáveis, eletricidade e explosivos",
      "Súmula 364/TST — necessidade de exposição permanente ou intermitente"
    ],
    "pedidos": [
      "Pagamento do adicional de periculosidade de 30%",
      "Reflexos legais sobre as demais parcelas",
      "Indenização substitutiva caso comprovado afastamento sem cessação do risco"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a exposição do reclamante a agentes perigosos, como inflamáveis, eletricidade ou explosivos, mencionando documentos anexados (PPP, LTCAT, laudos). Fundamente conforme art. 193 da CLT e NR-16. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Adicionais e condições"
  },

  {
    "fato": "Acúmulo de funções",
    "fundamentos": [
      "Art. 456, parágrafo único, da CLT — delimitação das funções contratadas",
      "Súmula 372/TST — direito a diferenças salariais quando houver desvio ou acúmulo",
      "Princípio da contraprestação justa e equilíbrio contratual"
    ],
    "pedidos": [
      "Pagamento de acréscimo salarial de 20% a 30% por acúmulo de funções",
      "Reflexos legais sobre férias, 13º, FGTS e verbas rescisórias"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo as atividades extras executadas pelo reclamante além das originalmente contratadas, com base em provas anexadas (testemunhos, organogramas, comunicações internas). Destaque a habitualidade e a ausência de contraprestação adequada. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Adicionais e condições"
  },

  {
    "fato": "Desvio de função",
    "fundamentos": [
      "Art. 460 da CLT — equiparação e pagamento do salário correspondente à função exercida",
      "Súmula 125/TST — equiparação salarial e desvio de função",
      "Princípio da isonomia e valorização do trabalho"
    ],
    "pedidos": [
      "Reconhecimento do desvio de função",
      "Pagamento das diferenças salariais",
      "Reflexos nas demais parcelas contratuais"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo o desvio funcional do reclamante, apontando as funções efetivamente desempenhadas e os documentos anexados (fichas de registro, relatórios, depoimentos). Fundamente no art. 460 da CLT e Súmula 125 do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Adicionais e condições"
  },

  {
    "fato": "Equiparação salarial",
    "fundamentos": [
      "Art. 461 da CLT — trabalho de igual valor",
      "Súmula 6/TST — requisitos da equiparação",
      "Art. 5º, caput, CF/88 — princípio da isonomia"
    ],
    "pedidos": [
      "Reconhecimento do direito à equiparação salarial com paradigma indicado",
      "Pagamento das diferenças salariais e reflexos",
      "Aplicação do art. 461, §1º e §3º da CLT"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a equiparação salarial pleiteada, indicando o paradigma, funções exercidas, tempo de serviço e produtividade, conforme documentos anexados (fichas, holerites, depoimentos). Fundamente conforme art. 461 da CLT e Súmula 6 do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Adicionais e condições"
  },

  {
    "fato": "Adicional noturno não pago",
    "fundamentos": [
      "Art. 73 da CLT — adicional de 20% sobre a hora noturna",
      "Súmula 60/TST — reflexos do adicional noturno",
      "Art. 7º, IX, CF/88 — direito à remuneração diferenciada"
    ],
    "pedidos": [
      "Pagamento do adicional noturno de 20% sobre as horas entre 22h e 5h",
      "Reflexos em DSR, férias, 13º e FGTS",
      "Diferenças de horas noturnas reduzidas"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo o labor noturno habitual, indicando horários e ausência de pagamento correto. Utilize provas anexadas (cartões de ponto, recibos, mensagens). Fundamente conforme art. 73 da CLT e Súmula 60 do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Adicionais e condições"
  },

  {
    "fato": "Supressão de adicional de insalubridade ou periculosidade sem mudança de função",
    "fundamentos": [
      "Súmula 248/TST — vedação à supressão de adicional sem alteração nas condições de trabalho",
      "Art. 468 da CLT — alteração contratual lesiva",
      "Art. 9º da CLT — nulidade de ato fraudulento"
    ],
    "pedidos": [
      "Restabelecimento do adicional anteriormente pago",
      "Pagamento retroativo das diferenças",
      "Reflexos em demais parcelas salariais"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a retirada indevida do adicional de insalubridade ou periculosidade, apontando que não houve alteração nas condições de trabalho. Fundamente conforme Súmula 248/TST e art. 468 da CLT. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Adicionais e condições"
  },

  // ---------------------------------------------------------
  // 🔸 BLOCO-RESUMO: ADICIONAIS E CONDIÇÕES
  // ---------------------------------------------------------
  {
    "modeloGeral": "Redija o capítulo completo 'DOS ADICIONAIS E DAS CONDIÇÕES DE TRABALHO', incluindo insalubridade, periculosidade, acúmulo e desvio de função, equiparação e adicionais suprimidos. Estruture tecnicamente conforme CLT, NR-15, NR-16 e jurisprudência do TST. O texto deve detalhar as condições de trabalho com base nas provas anexadas, em tom impessoal, técnico e forense.",
    "artigosRelacionados": [
      "Arts. 189, 192, 193, 456, 460, 461, 468 e 73 da CLT",
      "NR-15 e NR-16 do MTE",
      "Súmulas 6, 60, 80, 125, 248, 364 e 372 do TST"
    ],
    "categoria": "Adicionais e condições"
  },
  // ======================================
  // 💥 DANOS MORAIS E SAÚDE OCUPACIONAL
  // ======================================

  {
    "fato": "Assédio moral no ambiente de trabalho",
    "fundamentos": [
      "Art. 1º, III, CF/88 — princípio da dignidade da pessoa humana",
      "Art. 483, alíneas 'b' e 'e', CLT — rescisão indireta por rigor excessivo e ofensas",
      "Súmula 341/STF — responsabilidade objetiva do empregador por atos de seus prepostos",
      "Precedentes do TST — assédio reiterado e humilhações configuram dano moral"
    ],
    "pedidos": [
      "Indenização por danos morais em valor compatível com a gravidade do dano",
      "Reconhecimento de rescisão indireta do contrato (se aplicável)",
      "Retificação das anotações funcionais, se necessário"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo as condutas abusivas praticadas contra o reclamante (humilhações, xingamentos, isolamento, ameaças), indicando datas, testemunhas e provas anexadas (mensagens, gravações, relatos). Fundamente no art. 1º, III, CF/88 e art. 483 da CLT. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Danos morais e saúde"
  },

  {
    "fato": "Assédio sexual",
    "fundamentos": [
      "Art. 216-A do Código Penal — crime de assédio sexual",
      "Art. 483, 'e', CLT — falta grave do empregador ou preposto",
      "Art. 5º, X, CF/88 — inviolabilidade da intimidade e honra",
      "Precedentes do TST — dever do empregador de zelar pelo ambiente de trabalho"
    ],
    "pedidos": [
      "Indenização por danos morais e psicológicos",
      "Rescisão indireta do contrato de trabalho",
      "Comunicação ao Ministério Público do Trabalho (se cabível)"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo o assédio sexual sofrido pelo reclamante, indicando a hierarquia, a frequência dos atos, as provas anexadas (mensagens, e-mails, testemunhos) e o impacto emocional. Fundamente conforme art. 216-A do CP e art. 483 da CLT. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Danos morais e saúde"
  },

  {
    "fato": "Doença ocupacional com nexo causal",
    "fundamentos": [
      "Art. 20, §1º, Lei 8.213/91 — define acidente e doença equiparada",
      "Art. 157 da CLT — dever do empregador de adotar medidas de segurança",
      "Súmula 378/TST — estabilidade em caso de doença ocupacional",
      "Art. 7º, XXII, CF/88 — direito à redução dos riscos no trabalho"
    ],
    "pedidos": [
      "Reconhecimento do nexo causal entre doença e trabalho",
      "Indenização por danos morais e materiais",
      "Estabilidade provisória ou reintegração ao emprego",
      "Depósitos de FGTS e reflexos"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a doença ocupacional diagnosticada (ex: LER/DORT, depressão, hérnia), as condições do ambiente e as provas anexadas (ASO, CAT, laudos, atestados). Fundamente conforme Lei 8.213/91 e CLT. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Danos morais e saúde"
  },

  {
    "fato": "Acidente de trabalho típico",
    "fundamentos": [
      "Art. 19 da Lei 8.213/91 — conceito de acidente típico",
      "Art. 7º, XXVIII, CF/88 — seguro contra acidentes de trabalho e indenização",
      "Art. 927, parágrafo único, CC — responsabilidade objetiva em atividade de risco",
      "Súmula 229/STF — indenização cumulável com benefício previdenciário"
    ],
    "pedidos": [
      "Indenização por danos morais e materiais",
      "Pensão vitalícia proporcional à redução da capacidade",
      "Estabilidade provisória de 12 meses após o retorno",
      "Recolhimentos previdenciários e fundiários do período afastado"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo o acidente de trabalho (data, local, lesão, consequências) e as provas anexadas (CAT, laudos, fotos, atestados). Fundamente conforme Lei 8.213/91 e CF/88. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Danos morais e saúde"
  },

  {
    "fato": "Ambiente de trabalho degradante ou perigoso à saúde mental",
    "fundamentos": [
      "Art. 7º, XXII, CF/88 — direito ao meio ambiente de trabalho seguro",
      "Art. 157 da CLT — obrigação do empregador quanto às normas de segurança",
      "NR-17 — ergonomia e saúde mental",
      "Precedentes do TST sobre dano moral coletivo e ambiente degradante"
    ],
    "pedidos": [
      "Indenização por dano moral individual",
      "Melhoria das condições ambientais (obrigação de fazer)",
      "Reconhecimento da culpa patronal e violação à dignidade"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo as condições psicológicas adversas do ambiente laboral, como pressão excessiva, sobrecarga, humilhações ou falta de suporte, citando documentos anexados (atestados, relatórios médicos, comunicações internas). Fundamente conforme CF/88, CLT e NR-17. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Danos morais e saúde"
  },

  {
    "fato": "Responsabilidade civil do empregador por negligência médica em exame ocupacional",
    "fundamentos": [
      "Art. 157 e 168 da CLT — exames médicos obrigatórios",
      "Art. 186 e 927 do Código Civil — responsabilidade civil por negligência",
      "Lei 8.213/91 — dever de comunicação de doenças profissionais"
    ],
    "pedidos": [
      "Indenização por danos morais e materiais",
      "Reembolso de despesas médicas e tratamentos",
      "Obrigação de emitir CAT e comunicar INSS"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a negligência no exame médico ocupacional (ausência de exame admissional, periódico ou demissional), indicando consequências à saúde do reclamante e documentos anexados (ASO, laudos, comunicações). Fundamente conforme CLT e Código Civil. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Danos morais e saúde"
  },

  // ---------------------------------------------------------
  // 🔸 BLOCO-RESUMO: DANOS MORAIS E SAÚDE OCUPACIONAL
  // ---------------------------------------------------------
  {
    "modeloGeral": "Redija o capítulo completo 'DOS DANOS MORAIS E SAÚDE OCUPACIONAL', abrangendo assédio moral, assédio sexual, doença ocupacional, acidente típico e ambiente degradante. Descreva os fatos de forma técnica e sensível, com base nos documentos anexados (CAT, ASO, laudos, mensagens). Fundamente conforme CF/88, CLT, Lei 8.213/91 e precedentes do TST e STF, mantendo rigor técnico e linguagem jurídica impessoal.",
    "artigosRelacionados": [
      "Arts. 157, 168 e 483 da CLT",
      "Arts. 19 e 20 da Lei 8.213/91",
      "Art. 1º, III e Art. 7º, XXII e XXVIII da CF/88",
      "Art. 927 do Código Civil",
      "Súmulas 229/STF e 378/TST"
    ],
    "categoria": "Danos morais e saúde"
  },
  // ======================================
  // 🩺 ESTABILIDADES E GARANTIAS
  // ======================================

  {
    "fato": "Gestante dispensada sem estabilidade",
    "fundamentos": [
      "Art. 10, II, 'b', do ADCT — garantia de emprego à gestante",
      "Súmula 244/TST — estabilidade mesmo sem ciência do estado gestacional",
      "Art. 7º, XVIII, CF/88 — proteção à maternidade",
      "Art. 391-A da CLT — direito à reintegração ou indenização substitutiva"
    ],
    "pedidos": [
      "Reintegração imediata ao emprego",
      "Pagamento dos salários do período de afastamento",
      "Indenização substitutiva caso inviável o retorno",
      "Depósitos de FGTS e reflexos"
    ],
    "promptSugestao": "Redija o trecho fático narrando a dispensa da reclamante durante a gestação, indicando o período gestacional e os documentos anexados (atestados, exames, comunicações). Fundamente no art. 10, II, 'b', do ADCT e Súmula 244 do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Estabilidades e garantias"
  },

  {
    "fato": "Acidente de trabalho com estabilidade provisória",
    "fundamentos": [
      "Art. 118 da Lei 8.213/91 — estabilidade de 12 meses após retorno",
      "Súmula 378/TST — direito à estabilidade mesmo sem percepção de auxílio-acidente",
      "Art. 7º, XXII, CF/88 — proteção à saúde do trabalhador"
    ],
    "pedidos": [
      "Reintegração ao emprego com pagamento dos salários do período de afastamento",
      "Indenização substitutiva em caso de impossibilidade de retorno",
      "Depósitos de FGTS e demais reflexos legais"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo o acidente sofrido pelo reclamante, o afastamento previdenciário e o término do benefício, com base nos documentos anexados (CAT, atestados, comunicações). Fundamente conforme Lei 8.213/91 e Súmula 378 do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Estabilidades e garantias"
  },

  {
    "fato": "Dirigente sindical dispensado indevidamente",
    "fundamentos": [
      "Art. 543, §3º, CLT — estabilidade do dirigente sindical",
      "Súmula 369/TST — limites e abrangência da estabilidade sindical",
      "Art. 8º, VIII, CF/88 — vedação à dispensa do representante sindical"
    ],
    "pedidos": [
      "Reintegração imediata ao emprego",
      "Pagamento dos salários e vantagens do período afastado",
      "Indenização substitutiva em caso de impossibilidade de retorno"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a dispensa do reclamante no exercício do mandato sindical, indicando a data da eleição e do registro da candidatura. Fundamente conforme art. 543 da CLT e Súmula 369 do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Estabilidades e garantias"
  },

  {
    "fato": "Empregado acidentado readaptado dispensado",
    "fundamentos": [
      "Art. 93 da Lei 8.213/91 — reserva de vagas para reabilitados",
      "Art. 7º, XXII, CF/88 — proteção à integridade física",
      "Súmula 378, II, TST — estabilidade para acidentados e reabilitados"
    ],
    "pedidos": [
      "Reintegração ao cargo ou função compatível",
      "Indenização substitutiva em caso de impossibilidade de retorno",
      "Depósitos de FGTS e reflexos"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a dispensa do reclamante após readaptação profissional por motivo de acidente, citando documentos anexados (laudos, CAT, ASO). Fundamente conforme Lei 8.213/91 e Súmula 378/TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Estabilidades e garantias"
  },

  {
    "fato": "Empregado em vias de aposentadoria dispensado",
    "fundamentos": [
      "Convenção Coletiva — cláusula de estabilidade pré-aposentadoria",
      "Princípio da dignidade da pessoa humana e da função social do contrato",
      "Jurisprudência do TST — nulidade da dispensa em período estabilitário"
    ],
    "pedidos": [
      "Reintegração ou indenização substitutiva correspondente ao período de estabilidade",
      "Pagamento dos salários e reflexos do período de afastamento"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a dispensa do reclamante em período pré-aposentadoria previsto em norma coletiva, indicando a data de admissão, tempo de serviço e proximidade da aposentadoria. Fundamente conforme a CCT e jurisprudência do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Estabilidades e garantias"
  },

  {
    "fato": "Empregado afastado por doença comum dispensado",
    "fundamentos": [
      "Art. 471 da CLT — garantia de retorno após licença",
      "Art. 5º, XLI, CF/88 — vedação à dispensa discriminatória",
      "Súmula 443/TST — presunção de discriminação em dispensa de doente"
    ],
    "pedidos": [
      "Reintegração ao emprego com pagamento dos salários do período de afastamento",
      "Indenização por dano moral em caso de dispensa discriminatória",
      "Depósitos de FGTS e reflexos legais"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo o afastamento médico e a dispensa posterior, indicando as datas e documentos anexados (atestados, comunicações, laudos). Fundamente conforme CLT, CF/88 e Súmula 443/TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Estabilidades e garantias"
  },

  // ---------------------------------------------------------
  // 🔸 BLOCO-RESUMO: ESTABILIDADES E GARANTIAS
  // ---------------------------------------------------------
  {
    "modeloGeral": "Redija o capítulo completo 'DAS ESTABILIDADES E GARANTIAS', abrangendo estabilidade gestante, acidentária, sindical, do reabilitado, do doente e da pré-aposentadoria. Estruture o texto com base nos documentos anexados (CAT, atestados, comunicações, CCT). Fundamente conforme CLT, CF/88, Lei 8.213/91 e jurisprudência consolidada do TST.",
    "artigosRelacionados": [
      "Art. 10, II, 'b', ADCT",
      "Arts. 471 e 543 da CLT",
      "Art. 118 e 93 da Lei 8.213/91",
      "Súmulas 244, 369, 378 e 443 do TST"
    ],
    "categoria": "Estabilidades e garantias"
  },
  // ======================================
  // 💰 FGTS, MULTAS E BENEFÍCIOS
  // ======================================

  {
    "fato": "Ausência de recolhimento de FGTS",
    "fundamentos": [
      "Lei 8.036/90 — institui o FGTS e obriga o depósito mensal",
      "Art. 15 da Lei 8.036/90 — percentuais e prazos de recolhimento",
      "Súmula 461/TST — ônus do empregador em comprovar o depósito"
    ],
    "pedidos": [
      "Depósito de todos os valores de FGTS de todo o período contratual",
      "Multa de 40% sobre o total em caso de dispensa sem justa causa",
      "Apresentação das guias e extratos fundiários"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a ausência de recolhimento de FGTS, indicando os meses não depositados, com base nos documentos anexados (extrato analítico da Caixa, contracheques, comunicações). Fundamente conforme Lei 8.036/90 e Súmula 461/TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "FGTS, multas e benefícios"
  },

  {
    "fato": "Falta de depósito do INSS pelo empregador",
    "fundamentos": [
      "Art. 30, I, 'a', da Lei 8.212/91 — obrigação de recolhimento do INSS",
      "Art. 33, §5º, da Lei 8.212/91 — responsabilidade do empregador",
      "Precedentes do TST e TRFs — direito do empregado à retificação do CNIS"
    ],
    "pedidos": [
      "Recolhimento das contribuições previdenciárias de todo o contrato",
      "Retificação do CNIS e comprovação de recolhimento",
      "Indenização substitutiva em caso de prescrição do crédito previdenciário"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a ausência de recolhimento de INSS, informando os períodos trabalhados e os prejuízos previdenciários. Fundamente conforme Lei 8.212/91 e decisões do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "FGTS, multas e benefícios"
  },

  {
    "fato": "Falta de fornecimento de vale-transporte e vale-alimentação",
    "fundamentos": [
      "Lei 7.418/85 e Decreto 95.247/87 — direito ao vale-transporte",
      "Normas coletivas — concessão de tíquete-alimentação",
      "Princípio da intangibilidade salarial"
    ],
    "pedidos": [
      "Pagamento em pecúnia dos vales não fornecidos",
      "Reflexos nas demais parcelas salariais",
      "Aplicação das normas coletivas pertinentes"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a ausência de fornecimento de vale-transporte e vale-alimentação durante o contrato, indicando valores médios e períodos. Fundamente conforme Lei 7.418/85 e CCT aplicável. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "FGTS, multas e benefícios"
  },

  {
    "fato": "Multa do art. 467 da CLT por verbas incontroversas",
    "fundamentos": [
      "Art. 467 da CLT — acréscimo de 50% sobre parcelas não pagas na primeira audiência",
      "Súmula 69/TST — aplicação automática quando incontroversa a verba",
      "Princípio da celeridade processual e efetividade do crédito trabalhista"
    ],
    "pedidos": [
      "Condenação ao pagamento da multa de 50% sobre verbas incontroversas",
      "Reconhecimento da mora do empregador",
      "Aplicação de juros e correção monetária"
    ],
    "promptSugestao": "Redija o trecho fático mencionando a existência de verbas rescisórias incontroversas não quitadas na primeira audiência, com base em recibos e documentos anexados. Fundamente conforme art. 467 da CLT e Súmula 69 do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "FGTS, multas e benefícios"
  },

  {
    "fato": "Multa do art. 477, §8º, CLT por atraso no pagamento da rescisão",
    "fundamentos": [
      "Art. 477, §6º e §8º da CLT — prazo e multa por atraso",
      "Súmula 350/TST — mora no pagamento das verbas rescisórias",
      "Art. 459, §1º CLT — pontualidade salarial"
    ],
    "pedidos": [
      "Condenação ao pagamento da multa do art. 477, §8º, CLT",
      "Atualização monetária e juros legais",
      "Indenização por prejuízos decorrentes do atraso"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo o atraso no pagamento das verbas rescisórias, apontando as datas da dispensa e da quitação, com base nos comprovantes anexados. Fundamente conforme art. 477 da CLT e Súmula 350/TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "FGTS, multas e benefícios"
  },

  {
    "fato": "Ausência de fornecimento de seguro-desemprego",
    "fundamentos": [
      "Lei 7.998/90 — institui o seguro-desemprego",
      "Art. 477, §6º, CLT — obrigação de entrega das guias",
      "Princípio da proteção ao trabalhador desempregado"
    ],
    "pedidos": [
      "Indenização substitutiva correspondente às parcelas do seguro-desemprego",
      "Obrigação de entregar as guias SD",
      "Reembolso de despesas comprovadas com o não recebimento do benefício"
    ],
    "promptSugestao": "Redija o trecho fático descrevendo a não entrega das guias de seguro-desemprego, indicando as comunicações e prejuízos suportados pelo reclamante. Fundamente conforme Lei 7.998/90 e art. 477 da CLT. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "FGTS, multas e benefícios"
  },

  // ---------------------------------------------------------
  // 🔸 BLOCO-RESUMO: FGTS, MULTAS E BENEFÍCIOS
  // ---------------------------------------------------------
  {
    "modeloGeral": "Redija o capítulo completo 'DO FGTS, DAS MULTAS E DOS BENEFÍCIOS', abordando a ausência de depósitos fundiários e previdenciários, atraso de verbas rescisórias, não fornecimento de vales e multas legais. Estruture tecnicamente o texto conforme CLT, Leis 8.036/90, 8.212/91 e 7.418/85, com base nos documentos anexados (extratos, recibos, CCT). Mantenha linguagem forense técnica e impessoal.",
    "artigosRelacionados": [
      "Arts. 467 e 477 da CLT",
      "Lei 8.036/90 — FGTS",
      "Lei 8.212/91 — contribuições previdenciárias",
      "Lei 7.418/85 — vale-transporte",
      "Súmulas 69, 350 e 461 do TST"
    ],
    "categoria": "FGTS, multas e benefícios"
  },
  // ======================================
  // ⚖️ JUSTIÇA GRATUITA E HONORÁRIOS
  // ======================================

  {
    "fato": "Hipossuficiência econômica do reclamante",
    "fundamentos": [
      "Art. 5º, LXXIV, CF/88 — assistência jurídica integral aos necessitados",
      "Art. 98 do CPC — concessão de gratuidade da justiça",
      "Art. 790, §§3º e 4º da CLT — presunção de hipossuficiência ao trabalhador",
      "Súmula 463, I, TST — basta declaração de pobreza firmada pela parte"
    ],
    "pedidos": [
      "Concessão dos benefícios da justiça gratuita",
      "Isenção de custas e honorários periciais",
      "Reconhecimento da presunção de veracidade da declaração de pobreza"
    ],
    "promptSugestao": "Redija o trecho fático solicitando a concessão da justiça gratuita ao reclamante, informando sua situação de desemprego, ausência de renda e comprovantes anexados (holerites, extratos, declarações). Fundamente conforme CF/88, CLT e CPC. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Justiça gratuita e honorários"
  },

  {
    "fato": "Honorários advocatícios sucumbenciais",
    "fundamentos": [
      "Art. 791-A da CLT — honorários sucumbenciais entre 5% e 15%",
      "Art. 85, §2º, CPC — critérios de fixação dos honorários",
      "Súmula 219 e 329 do TST — honorários assistenciais e contratuais"
    ],
    "pedidos": [
      "Condenação da reclamada ao pagamento de honorários advocatícios sucumbenciais de 15%",
      "Base de cálculo sobre o valor da condenação ou proveito econômico obtido",
      "Atualização monetária até o efetivo pagamento"
    ],
    "promptSugestao": "Redija o trecho fático requerendo honorários advocatícios sucumbenciais, mencionando a atuação profissional do patrono e a previsão do art. 791-A da CLT. Fundamente conforme CPC e jurisprudência do TST. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Justiça gratuita e honorários"
  },

  {
    "fato": "Honorários periciais e ônus da prova técnica",
    "fundamentos": [
      "Art. 790-B da CLT — responsabilidade pelo pagamento dos honorários periciais",
      "Súmula 457/TST — limitação dos honorários à tabela do CSJT",
      "Art. 818 da CLT — ônus da prova e inversão quando comprovada hipossuficiência"
    ],
    "pedidos": [
      "Determinação para que a reclamada arque com os honorários periciais em caso de sucumbência",
      "Fixação dos honorários conforme tabela do CSJT",
      "Isenção do reclamante por ser beneficiário da justiça gratuita"
    ],
    "promptSugestao": "Redija o trecho fático requerendo a inversão do ônus da prova técnica e a condenação da reclamada ao pagamento dos honorários periciais, conforme resultado da perícia e aplicação do art. 790-B da CLT. Fundamente de forma objetiva e técnica. O texto deve estar pronto para inserção em petição inicial, com linguagem técnica e forense, mantendo coesão, clareza e impessoalidade.",
    "categoria": "Justiça gratuita e honorários"
  },

  // ---------------------------------------------------------
  // 🔸 BLOCO-RESUMO: JUSTIÇA GRATUITA E HONORÁRIOS
  // ---------------------------------------------------------
  {
    "modeloGeral": "Redija o capítulo 'DA JUSTIÇA GRATUITA E DOS HONORÁRIOS', abordando a hipossuficiência do reclamante, o pedido de gratuidade, a fixação de honorários advocatícios e a responsabilidade pelos honorários periciais. Fundamente conforme CF/88, CLT, CPC e súmulas do TST, com base nos documentos anexados (declaração de pobreza, comprovantes de renda, procuração). Mantenha tom técnico e jurídico forense.",
    "artigosRelacionados": [
      "Arts. 790, 790-B e 791-A da CLT",
      "Art. 5º, LXXIV da CF/88",
      "Art. 98 do CPC",
      "Súmulas 219, 329, 457 e 463 do TST"
    ],
    "categoria": "Justiça gratuita e honorários"
  }

];

// ===========================================================
// ✅ FIM DO ARQUIVO
// ===========================================================
